import ArrowDropDownIcon from '@mui/icons-material/ArrowDropDown';
import {
  Accordion,
  AccordionDetails,
  AccordionSummary,
  Typography,
} from '@mui/material';
import './Sidebar.css';
import { NavLink, useLocation } from 'react-router-dom';
import { useState } from 'react';

const Sidebar = () => {
  const [locationExpanded, setLocationExpended] = useState(false);
  const [donatorsExpanded, setDonatorsExpended] = useState(false);
  const location = useLocation();
  const isLocation =
    location.pathname.includes('governments') ||
    location.pathname.includes('cities') ||
    location.pathname.includes('areas');

  /* useEffect(() => {
    const sidebar = sidebarRef.current;
    if (!sidebar) return;

    const handleMouseEnter = () => {
      activeLinksRef.current = Array.from(sidebar.querySelectorAll('a.active'));

      openAccordionsRef.current = Array.from(
        sidebar.querySelectorAll('.sidebar-accordion.open')
      );

      activeLinksRef.current.forEach((el) => el.classList.remove('active'));

      openAccordionsRef.current.forEach((el) => el.classList.remove('open'));
    };

    const handleMouseLeave = () => {
      activeLinksRef.current.forEach((el) => el.classList.add('active'));

      openAccordionsRef.current.forEach((el) => el.classList.add('open'));
    };

    sidebar.addEventListener('mouseenter', handleMouseEnter);
    sidebar.addEventListener('mouseleave', handleMouseLeave);

    return () => {
      sidebar.removeEventListener('mouseenter', handleMouseEnter);
      sidebar.removeEventListener('mouseleave', handleMouseLeave);
    };
  }, []); */
  return (
    <div className='sidebar'>
      <div className='holder'>
        <div className='logo'>
          <img src='/Logo.svg' alt='لوغو' />
        </div>
        <ul>
          <li>
            <NavLink to='/content/dashboard'>
              <svg
                xmlns='http://www.w3.org/2000/svg'
                width='17'
                height='17'
                viewBox='0 0 17 17'
                fill='none'
                className='icon link-icon'
              >
                <path
                  d='M15.4231 7.92308L10.8077 7.92308C10.6547 7.92308 10.5079 7.98386 10.3997 8.09205C10.2916 8.20025 10.2308 8.34699 10.2308 8.5L10.2308 15.4231C10.2308 15.5761 10.2916 15.7228 10.3997 15.831C10.5079 15.9392 10.6547 16 10.8077 16L15.4231 16C15.5761 16 15.7228 15.9392 15.831 15.831C15.9392 15.7228 16 15.5761 16 15.4231L16 8.5C16 8.34699 15.9392 8.20025 15.831 8.09205C15.7228 7.98386 15.5761 7.92308 15.4231 7.92308ZM15.4231 1L10.8077 1C10.6547 1 10.5079 1.06078 10.3997 1.16898C10.2916 1.27717 10.2308 1.42391 10.2308 1.57692L10.2308 3.89615C10.2308 4.04916 10.2916 4.19591 10.3997 4.3041C10.5079 4.41229 10.6547 4.47308 10.8077 4.47308L15.4231 4.47308C15.5761 4.47308 15.7228 4.41229 15.831 4.3041C15.9392 4.19591 16 4.04916 16 3.89615L16 1.57692C16 1.42391 15.9392 1.27717 15.831 1.16898C15.7228 1.06078 15.5761 1 15.4231 1ZM6.19231 1L1.57692 1C1.42391 1 1.27717 1.06078 1.16898 1.16898C1.06078 1.27717 1 1.42391 1 1.57692L1 8.5C1 8.65301 1.06078 8.79975 1.16898 8.90795C1.27717 9.01614 1.42391 9.07692 1.57692 9.07692L6.19231 9.07692C6.34532 9.07692 6.49206 9.01614 6.60025 8.90795C6.70845 8.79975 6.76923 8.65301 6.76923 8.5L6.76923 1.57692C6.76923 1.42391 6.70845 1.27717 6.60025 1.16898C6.49206 1.06078 6.34532 1 6.19231 1ZM6.19231 12.5269L1.57692 12.5269C1.42391 12.5269 1.27717 12.5877 1.16898 12.6959C1.06078 12.8041 1 12.9508 1 13.1038L1 15.4231C1 15.5761 1.06078 15.7228 1.16898 15.831C1.27717 15.9392 1.42391 16 1.57692 16L6.19231 16C6.34532 16 6.49206 15.9392 6.60025 15.831C6.70845 15.7228 6.76923 15.5761 6.76923 15.4231L6.76923 13.1038C6.76923 12.9508 6.70845 12.8041 6.60025 12.6959C6.49206 12.5877 6.34532 12.5269 6.19231 12.5269Z'
                  fill='#004A5B'
                  stroke='#004A5B'
                  strokeWidth='2'
                  strokeLinecap='round'
                  strokeLinejoin='round'
                />
              </svg>
              <span>لوحة التحكم</span>
            </NavLink>
          </li>
          <li>
            <Accordion
              expanded={locationExpanded}
              onChange={(_, isExpanded) => setLocationExpended(isExpanded)}
              className={
                isLocation ? 'open sidebar-accordion' : 'sidebar-accordion'
              }
              disableGutters
              elevation={0}
              sx={{
                backgroundColor: 'transparent',
                boxShadow: 'none',
              }}
            >
              <AccordionSummary
                expandIcon={<ArrowDropDownIcon className='icon' />}
                sx={{
                  px: 0,
                  minHeight: 'fit-content',
                  width: 'fit-content',
                  '& .MuiAccordionSummary-content': {
                    margin: 0,
                  },
                }}
              >
                <Typography className='accordion-title' fontWeight={500}>
                  <svg
                    xmlns='http://www.w3.org/2000/svg'
                    width='17'
                    height='21'
                    viewBox='0 0 17 21'
                    fill='none'
                    className='icon link-icon'
                  >
                    <path
                      d='M1.19688 18.831C0.901358 18.9728 0.627995 18.9329 0.376797 18.7113C0.125599 18.4897 0 18.1926 0 17.8203V2.92572C0 2.69521 0.0554113 2.49129 0.166234 2.31398C0.277057 2.13666 0.428514 2.00367 0.620607 1.91502L5.31949 0L10.639 2.23418L14.7616 0.319169C15.0571 0.177316 15.3305 0.217212 15.5817 0.438858C15.8329 0.660503 15.9585 0.957508 15.9585 1.32987V10.2932C15.7368 9.88538 15.4745 9.51302 15.1716 9.17612C14.8687 8.83922 14.5399 8.54664 14.1853 8.2984V2.87252L11.5256 4.09601V7.44728C11.2153 7.44728 10.9123 7.47831 10.6168 7.54037C10.3213 7.60244 10.0331 7.69553 9.75239 7.81965V4.09601L6.20607 2.60655V16.517L1.19688 18.831ZM1.77316 16.2776L4.43291 15.0542V2.60655L1.77316 3.67045V16.2776ZM11.5256 15.9585C12.028 15.9585 12.4454 15.7811 12.7779 15.4265C13.1103 15.0719 13.2839 14.5399 13.2987 13.8307C13.3135 13.2278 13.1473 12.7224 12.8 12.3146C12.4528 11.9068 12.028 11.7029 11.5256 11.7029C11.0232 11.7029 10.602 11.9068 10.2622 12.3146C9.92232 12.7224 9.75239 13.2278 9.75239 13.8307C9.75239 14.4335 9.92232 14.9389 10.2622 15.3467C10.602 15.7545 11.0232 15.9585 11.5256 15.9585ZM11.5256 18.0863C10.5503 18.0863 9.71545 17.6696 9.02096 16.8362C8.32648 16.0028 7.97923 15.001 7.97923 13.8307C7.97923 12.6604 8.32648 11.6585 9.02096 10.8252C9.71545 9.99177 10.5503 9.57508 11.5256 9.57508C12.5008 9.57508 13.3357 9.99177 14.0301 10.8252C14.7246 11.6585 15.0719 12.6604 15.0719 13.8307C15.0719 14.2385 15.0312 14.6242 14.95 14.9877C14.8687 15.3512 14.7468 15.6925 14.5843 16.0117L16.845 18.7246L15.6038 20.2141L13.343 17.5011C13.0771 17.6962 12.7926 17.8424 12.4897 17.94C12.1868 18.0375 11.8654 18.0863 11.5256 18.0863Z'
                      fill='white'
                    />
                  </svg>
                  <span>إدارة الأماكن</span>
                </Typography>
              </AccordionSummary>

              <AccordionDetails sx={{ px: 2, py: 1 }}>
                <Typography variant='body2'>
                  <NavLink to='/content/governments'>
                    <span>المحافظات</span>
                  </NavLink>
                </Typography>
                <Typography variant='body2'>
                  <NavLink to='/content/cities'>
                    <span>المدن</span>
                  </NavLink>
                </Typography>
                <Typography variant='body2'>
                  <NavLink to='/content/areas'>
                    <span>المناطق</span>
                  </NavLink>
                </Typography>
              </AccordionDetails>
            </Accordion>
          </li>
          <li>
            <NavLink to='/content/projects'>
              <svg
                xmlns='http://www.w3.org/2000/svg'
                width='19'
                height='22'
                viewBox='0 0 19 22'
                fill='none'
                className='icon link-icon'
              >
                <path
                  d='M1.867 21.2838C1.35357 21.2838 0.914052 21.0644 0.548431 20.6257C0.18281 20.1869 0 19.6595 0 19.0434V6.7212C0 6.10509 0.18281 5.57766 0.548431 5.13892C0.914052 4.70017 1.35357 4.4808 1.867 4.4808H5.601V2.2404C5.601 1.62429 5.78381 1.09686 6.14943 0.658118C6.51505 0.219373 6.95458 0 7.468 0H11.202C11.7154 0 12.1549 0.219373 12.5206 0.658118C12.8862 1.09686 13.069 1.62429 13.069 2.2404V4.4808H16.803C17.3164 4.4808 17.7559 4.70017 18.1216 5.13892C18.4872 5.57766 18.67 6.10509 18.67 6.7212V19.0434C18.67 19.6595 18.4872 20.1869 18.1216 20.6257C17.7559 21.0644 17.3164 21.2838 16.803 21.2838H1.867ZM7.468 4.4808H11.202V2.2404H7.468V4.4808ZM16.803 14.5626H12.1355V16.803H6.5345V14.5626H1.867V19.0434H16.803V14.5626ZM8.4015 14.5626H10.2685V12.3222H8.4015V14.5626ZM1.867 12.3222H6.5345V10.0818H12.1355V12.3222H16.803V6.7212H1.867V12.3222Z'
                  fill='white'
                />
              </svg>
              <span>إدارة المشاريع</span>
            </NavLink>
          </li>
          <li>
            <NavLink to='/content/campaigns'>
              <svg
                xmlns='http://www.w3.org/2000/svg'
                width='19'
                height='21'
                viewBox='0 0 19 21'
                fill='none'
                className='icon link-icon'
              >
                <path
                  d='M3.16667 21C2.28704 21 1.53935 20.6937 0.923611 20.0812C0.30787 19.4688 0 18.725 0 17.85V14.7H3.16667V0L4.75 1.575L6.33333 0L7.91667 1.575L9.5 0L11.0833 1.575L12.6667 0L14.25 1.575L15.8333 0L17.4167 1.575L19 0V17.85C19 18.725 18.6921 19.4688 18.0764 20.0812C17.4606 20.6937 16.713 21 15.8333 21H3.16667ZM15.8333 18.9C16.1324 18.9 16.3831 18.7994 16.5854 18.5981C16.7877 18.3969 16.8889 18.1475 16.8889 17.85V3.15H5.27778V14.7H14.7778V17.85C14.7778 18.1475 14.8789 18.3969 15.0813 18.5981C15.2836 18.7994 15.5343 18.9 15.8333 18.9ZM6.33333 7.35V5.25H12.6667V7.35H6.33333ZM6.33333 10.5V8.4H12.6667V10.5H6.33333ZM14.7778 7.35C14.4787 7.35 14.228 7.24937 14.0257 7.04812C13.8234 6.84687 13.7222 6.5975 13.7222 6.3C13.7222 6.0025 13.8234 5.75312 14.0257 5.55187C14.228 5.35062 14.4787 5.25 14.7778 5.25C15.0769 5.25 15.3275 5.35062 15.5299 5.55187C15.7322 5.75312 15.8333 6.0025 15.8333 6.3C15.8333 6.5975 15.7322 6.84687 15.5299 7.04812C15.3275 7.24937 15.0769 7.35 14.7778 7.35ZM14.7778 10.5C14.4787 10.5 14.228 10.3994 14.0257 10.1981C13.8234 9.99687 13.7222 9.7475 13.7222 9.45C13.7222 9.1525 13.8234 8.90312 14.0257 8.70187C14.228 8.50062 14.4787 8.4 14.7778 8.4C15.0769 8.4 15.3275 8.50062 15.5299 8.70187C15.7322 8.90312 15.8333 9.1525 15.8333 9.45C15.8333 9.7475 15.7322 9.99687 15.5299 10.1981C15.3275 10.3994 15.0769 10.5 14.7778 10.5ZM3.16667 18.9H12.6667V16.8H2.11111V17.85C2.11111 18.1475 2.21227 18.3969 2.41458 18.5981C2.6169 18.7994 2.86759 18.9 3.16667 18.9Z'
                  fill='white'
                />
              </svg>
              <span>إدارة الحملات</span>
            </NavLink>
          </li>
          <li>
            <Accordion
              expanded={donatorsExpanded}
              onChange={(_, isExpanded) => setDonatorsExpended(isExpanded)}
              className={
                location.pathname.includes('donators')
                  ? 'open sidebar-accordion'
                  : 'sidebar-accordion'
              }
              disableGutters
              elevation={0}
              sx={{
                backgroundColor: 'transparent',
                boxShadow: 'none',
              }}
            >
              <AccordionSummary
                expandIcon={<ArrowDropDownIcon className='icon' />}
                sx={{
                  px: 0,
                  minHeight: 'fit-content',
                  width: 'fit-content',
                  '& .MuiAccordionSummary-content': {
                    margin: 0,
                  },
                }}
              >
                <Typography className='accordion-title' fontWeight={500}>
                  <svg
                    xmlns='http://www.w3.org/2000/svg'
                    width='19'
                    height='23'
                    viewBox='0 0 19 23'
                    fill='none'
                    className='icon link-icon'
                  >
                    <path
                      d='M15.8571 13.2143V6.34286L11.4524 2.64286L7.04762 6.34286V7.92857H5.28571V5.28571L11.4524 0L17.619 5.28571V13.2143H15.8571ZM11.8929 6.87143H12.7738V5.81429H11.8929V6.87143ZM10.131 6.87143H11.0119V5.81429H10.131V6.87143ZM11.8929 8.98571H12.7738V7.92857H11.8929V8.98571ZM10.131 8.98571H11.0119V7.92857H10.131V8.98571ZM5.28571 17.9714L11.4083 19.98L16.65 18.0243C16.5766 17.8657 16.4701 17.7292 16.3307 17.6146C16.1912 17.5001 16.0333 17.4429 15.8571 17.4429H11.4083C11.0119 17.4429 10.6962 17.4252 10.4613 17.39C10.2264 17.3548 9.98413 17.2843 9.73452 17.1786L7.68631 16.3593L8.17083 14.2979L9.95476 15.0114C10.2044 15.0995 10.498 15.17 10.8357 15.2229C11.1734 15.2757 11.6726 15.311 12.3333 15.3286C12.3333 15.1348 12.2856 14.9498 12.1902 14.7736C12.0947 14.5974 11.981 14.4829 11.8488 14.43L6.69524 12.1571H5.28571V17.9714ZM0 21.6714V10.0429H6.69524C6.79802 10.0429 6.90079 10.0561 7.00357 10.0825C7.10635 10.1089 7.20179 10.1398 7.28988 10.175L12.4655 12.4743C12.95 12.6857 13.3428 13.0557 13.6438 13.5843C13.9447 14.1129 14.0952 14.6943 14.0952 15.3286H15.8571C16.5913 15.3286 17.2153 15.6193 17.7292 16.2007C18.2431 16.7821 18.5 17.5486 18.5 18.5V19.5571L11.4524 22.2L5.28571 20.1386V21.6714H0ZM1.7619 19.5571H3.52381V12.1571H1.7619V19.5571Z'
                      fill='white'
                    />
                  </svg>
                  <span>إدارة المتبرعين</span>
                </Typography>
              </AccordionSummary>

              <AccordionDetails sx={{ px: 2, py: 1 }}>
                <Typography variant='body2'>
                  <NavLink to='/content/governments'>
                    <span>المحافظات</span>
                  </NavLink>
                </Typography>
                <Typography variant='body2'>
                  <NavLink to='/content/cities'>
                    <span>المدن</span>
                  </NavLink>
                </Typography>
                <Typography variant='body2'>
                  <NavLink to='/content/areas'>
                    <span>المناطق</span>
                  </NavLink>
                </Typography>
              </AccordionDetails>
            </Accordion>
          </li>
          <li>
            <NavLink to='/'>
              <svg
                xmlns='http://www.w3.org/2000/svg'
                width='22'
                height='19'
                viewBox='0 0 22 19'
                fill='none'
                className='icon link-icon'
              >
                <path
                  d='M2.09639 14.6747V6.28916V6.62982V2.09639V14.6747ZM2.09639 4.19277H18.8675V2.09639H2.09639V4.19277ZM10.0364 16.7711H2.09639C1.51988 16.7711 1.02636 16.5658 0.615813 16.1553C0.205271 15.7447 0 15.2512 0 14.6747V2.09639C0 1.51988 0.205271 1.02636 0.615813 0.615813C1.02636 0.205271 1.51988 0 2.09639 0H18.8675C19.444 0 19.9375 0.205271 20.348 0.615813C20.7586 1.02636 20.9639 1.51988 20.9639 2.09639V7.67801C20.3524 7.24126 19.6842 6.9006 18.9592 6.65602C18.2342 6.41145 17.4699 6.28916 16.6663 6.28916C15.6705 6.28916 14.7315 6.47696 13.8492 6.85256C12.967 7.22816 12.194 7.73916 11.5301 8.38554H2.09639V14.6747H9.40753C9.45994 15.0416 9.53855 15.3997 9.64337 15.7491C9.74819 16.0985 9.87922 16.4392 10.0364 16.7711ZM15.6181 18.8675L15.3036 17.2952C15.094 17.2078 14.8974 17.1161 14.714 17.02C14.5306 16.9239 14.3428 16.806 14.1506 16.6663L12.6307 17.138L11.5825 15.356L12.788 14.3078C12.753 14.0807 12.7355 13.8536 12.7355 13.6265C12.7355 13.3994 12.753 13.1723 12.788 12.9452L11.5825 11.897L12.6307 10.1151L14.1506 10.5867C14.3428 10.447 14.5306 10.3291 14.714 10.233C14.8974 10.1369 15.094 10.0452 15.3036 9.95783L15.6181 8.38554H17.7145L18.0289 9.95783C18.2386 10.0452 18.4351 10.1369 18.6185 10.233C18.802 10.3291 18.9898 10.447 19.1819 10.5867L20.7018 10.1151L21.75 11.897L20.5446 12.9452C20.5795 13.1723 20.597 13.3994 20.597 13.6265C20.597 13.8536 20.5795 14.0807 20.5446 14.3078L21.75 15.356L20.7018 17.138L19.1819 16.6663C18.9898 16.806 18.802 16.9239 18.6185 17.02C18.4351 17.1161 18.2386 17.2078 18.0289 17.2952L17.7145 18.8675H15.6181ZM16.6663 15.7229C17.2428 15.7229 17.7363 15.5176 18.1468 15.1071C18.5574 14.6965 18.7626 14.203 18.7626 13.6265C18.7626 13.05 18.5574 12.5565 18.1468 12.1459C17.7363 11.7354 17.2428 11.5301 16.6663 11.5301C16.0898 11.5301 15.5962 11.7354 15.1857 12.1459C14.7752 12.5565 14.5699 13.05 14.5699 13.6265C14.5699 14.203 14.7752 14.6965 15.1857 15.1071C15.5962 15.5176 16.0898 15.7229 16.6663 15.7229Z'
                  fill='white'
                />
              </svg>
              <span>العمليات المالية</span>
            </NavLink>
          </li>
        </ul>
      </div>
      <button className='log-out'>
        <svg
          xmlns='http://www.w3.org/2000/svg'
          width='24'
          height='24'
          viewBox='0 0 24 24'
          fill='none'
          className='log-out-icon'
        >
          <path
            d='M20.3998 20.4H10.7998V22.8H20.3998C21.0363 22.8 21.6468 22.5472 22.0969 22.0971C22.5469 21.647 22.7998 21.0366 22.7998 20.4V3.60005C22.7998 2.96353 22.5469 2.35308 22.0969 1.90299C21.6468 1.4529 21.0363 1.20005 20.3998 1.20005H10.7998V3.60005H20.3998V20.4Z'
            fill='white'
          />
          <path d='M8.4 18V13.2H18V10.8H8.4V6L1.2 12L8.4 18Z' fill='white' />
        </svg>
        <span>تسجيل الخروج</span>
      </button>
    </div>
  );
};

export default Sidebar;
